app/controllers/activities_controller.rb

  def create
    activity = @contact.activities.new(activity_params)

    if activity.save
---
INSERT INTO "activities" ("contact_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["contact_id", 3], ["description", "Gambling"], ["created_at", "2019-07-09 17:42:49.361118"], ["updated_at", "2019-07-09 17:42:49.361118"]]

  def update
    if @activity.update(activity_params)
---
UPDATE "activities" SET "description" = $1, "updated_at" = $2 WHERE "activities"."id" = $3  [["description", "Swimfsming"], ["updated_at", "2019-07-09 16:31:02.970417"], ["id", 2]]

  def set_contact
    @contact = Contact.find_by_id(params[:contact_id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def set_activity
    @activity = @contact.activities.find_by_id(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."contact_id" = $1 AND "activities"."id" = $2 LIMIT $3  [["contact_id", 3], ["id", 7], ["LIMIT", 1]]