app/controllers/contacts_controller.rb

  def index
    render json: Contact.all, status: :ok
---
SELECT "contacts".* FROM "contacts"

  def create
    contact = Contact.new(contact_params)

    if contact.save
---
INSERT INTO "contacts" ("first_name", "last_name", "cell_phone", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "John"], ["last_name", "Lennon"], ["cell_phone", "454345"], ["zip_code", 12345], ["created_at", "2019-07-09 18:13:46.674748"], ["updated_at", "2019-07-09 18:13:46.674748"]]

  def update
    if @contact.update(contact_params)
---
UPDATE "contacts" SET "first_name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["first_name", "Johgrwn"], ["updated_at", "2019-07-09 19:59:07.755263"], ["id", 7]]

  def set_contact
    @contact = Contact.find_by_id(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]